[
  { "id": 1, "text": "What is your concept of marriage?" },
  { "id": 2, "text": "Have you ever been married before?" },
  { "id": 3, "text": "Are you married now?" },
  { "id": 4, "text": "What are your expectations of marriage?" },
  { "id": 5, "text": "What are your goals in life? Long term and short term plans." },
  { "id": 6, "text": "Identify three things that you want to accomplish in the near future." },
  { "id": 7, "text": "Identify three things that you want to accomplish, long-term." },
  { "id": 8, "text": "Why have you chosen me as your potential spouse?" },
  { "id": 9, "text": "What is the role of religion in your life – now?" },
  { "id": 10, "text": "Are you a spiritual person?" },
  { "id": 11, "text": "What is your understanding of an Islamic marriage?" },
  { "id": 12, "text": "What are you expecting of your spouse, religiously?" },
  { "id": 13, "text": "What is your relationship between yourself and the Muslim community in your area?" },
  { "id": 14, "text": "Are you volunteering in any Islamic activities?" },
  { "id": 15, "text": "What can you offer your mate, spiritually?" },
  { "id": 16, "text": "What is the role of a husband?" },
  { "id": 17, "text": "What is the role of a wife?" },
  { "id": 18, "text": "Do you want to practice polygamy?" },
  { "id": 19, "text": "What is your relationship with your family?" },
  { "id": 20, "text": "What do you expect your relationship to be like with the family of your spouse?" },
  { "id": 21, "text": "What do you expect the relationship between your spouse and your family to be like?" },
  { "id": 22, "text": "Is there anyone in your family that lives with you now?" },
  { "id": 23, "text": "Are you planning to have anyone in your family live with you in the future?" },
  { "id": 24, "text": "If for any reason my relationship with your family turns sour, what should be done?" },
  { "id": 25, "text": "Who are your friends? Identify at least three." },
  { "id": 26, "text": "How did you get to know them?" },
  { "id": 27, "text": "Why are they your friends?" },
  { "id": 28, "text": "What do you like most about them?" },
  { "id": 29, "text": "What will your relationship with them be like after marriage?" },
  { "id": 30, "text": "Do you have friends from the opposite sex?" }
] 